#!/usr/bin/python3

# -*- coding: utf-8 -*-
"""
Created on Sun Aug  9 20:37:24 2020
@author: Heedong Ynag
@Usage: Closed School Utilization Project
    - Apply tf-idf algorithm on news articles for credibility
"""
from math import log10
from konlpy.tag import Okt
import pandas as pd
#import matplotlib.font_manager as fm

def tf(t, d):
    ## Term-Frequency
    # t is term in document
    # d is document
    return d.count(t)/10

def idf(t, dlist):
    ## d is document  (dlist is list of total documents)
    df = 0 ##number of doc contains term
    for d in dlist:
        if t in d:
            df = df + 1
    numerator = len(dlist)
    denominator = 1 + df

    return log10(numerator/denominator)

def tfidf(t, d, dlist):
    ### result is count of
    return tf(t, d) * idf(t, dlist)

def get_allNouns(file):
    f = open(file, 'r', encoding='utf-8')
    text = f.read()
    f.close()
    okt = Okt()
    nouns = okt.nouns(text)
    return nouns

def run_tfidf(terms, file):
    li = ["효율성","활용성","활용가치","평생교육","편리성","특성화","친환경","지역발전","지역문화","지역경제","정체성","자연환경","자연생태","일자리","유관기관","역사성","역사도시","수익성","생태공간",
            "보호구역","문화창출","농어촌","네트워크","관광지","관광자원","관광거점","관광객","공동체","공공시설","공간구성","경제성","휴양","훈련","회화","활성화","현장","행사","해양","학습","학교폭력","피해자","특산","텃밭","탐구","캠핑","카페","친환경","치즈","치유","축제","추억","촬영","체험","체육","창작","창고",
            "집단","직업","지역","지식","중독","주방","조각","제조","제작","정신","정서","전통","전시","재활","재현","재배","장애인","작품","작가","자전거","자연","일자리","인재","인성","육성",
            "원어민","워크숍","예절","예술","영화","영어","영상","영농","연수","연극","연구","역사","여행","에코","야외","야영","야구장","아리랑","심리","실습","식물","식당","시설","숙소","숙박",
            "수학여행","수련","세미나","샤워실","생산","사회복지","사진","사이클링","사랑방","북카페","볼거리","보호","보존","보건","발전","발명","반딧불","박물관","바다","민속","미술","문화","무대",
            "목공","명소","명상","먹거리","된장","동아리","독서","도예","도서관","대회","다문화","농촌","농장","농업","농산물","나비","기술","극단","귀촌","귀농","국악","교육","교실","교류","관광",
            "과학","공원","공예","공연","공동체","공공기관","곤충","경제","건강"]

    #li우수 = ["휴양","훈련","회화","활성화","현장","행사","해양","학습","학교폭력","피해자","특산","텃밭","탐구","캠핑","카페","친환경","치즈","치유","축제","추억","촬영","체험","체육","창작","창고",
     #       "집단","직업","지역","지식","중독","주방","조각","제조","제작","정신","정서","전통","전시","재활","재현","재배","장애인","작품","작가","자전거","자연","일자리","인재","인성","육성",
      #      "원어민","워크숍","예절","예술","영화","영어","영상","영농","연수","연극","연구","역사","여행","에코","야외","야영","야구장","아리랑","심리","실습","식물","식당","시설","숙소","숙박",
       #     "수학여행","수련","세미나","샤워실","생산","사회복지","사진","사이클링","사랑방","북카페","볼거리","보호","보존","보건","발전","발명","반딧불","박물관","바다","민속","미술","문화","무대",
        ##   "과학","공원","공예","공연","공동체","공공기관","곤충","경제","건강"]
    f = open(file, 'r', encoding='utf-8')
    dstr = f.read()
    dlist = list(dstr.split("|"))
    f.close()
    tfDict = {}
    idfValues = {}
    tfidfDict = {}
    for term in terms:
        if len(term) > 1 and term in li:
            tfDict[term] = tf(term, dstr)
            idfValues[term] = idf(term, dlist)
            tfidfDict[term] = round(tfDict[term]*idfValues[term], 2)
    return tfidfDict

def preprocess_forWordcloud(tfidfDict):
    tlist = []; tstr = '';
    f = open('지표와우수사례_termstext_forWC.txt', 'w', encoding='utf-8')
    for term in tfidfDict.keys():
        tlist.append(f"{term} "* round(tfidfDict[term]))
    tstr = ' '.join(tlist)
    f.write(tstr)

def to_excel(tfidfDict):
    df = pd.DataFrame(list(tfidfDict.items()),columns = ['Terms','tf-idf'])
    df.to_excel(r'C:/Users/heedong/지표와우수사례.xlsx', index = False, encoding = 'utf-8-sig')

if __name__ == "__main__":
    terms = ['지역경제', '소득증대', '관광객','수익성', '일자리', '관광거점','평생교육', '문화창출', '복지증대','지역발전','유지관리', '보존관리', '효율성','지속가능', '임대','기간',
             '활용성','기능성','가변성','활용도','리모델링','공간구성','공공시설','공간효율','공간설계','편의시설','편의공간','휴식공간','편리성','자연생태','친환경','생태공간',
             "유관기관", "연계활용", "네트워크","지역문화", "역사도시", "관광지", "특성화", "정체성", "역사성", "관광자원","지역주민", "주민투표", "공동체", "주민자치위원회", "의견수렴",
             "사업비", "지원사업", "투자성", "활용률", "활용가치", "미활용", "방치", "사업계획서", "경제성","농어촌", "도서벽지", "도심지역", "산간벽지", "자연환경", "보호구역", "구도심",
             "감상","감성","강당","개방","갤러리","거주","건강","걷기","경제","계절","고용","곤충","공공기관","공동체","공연","공예","공원","과학","관광","관내","관람","관찰","교도소","교류","교실","교육","교환","구민","국악","군민",
             "귀농","귀촌","극단","극장","기념관","기술","기업","나눔","나무","나비","노인","녹색","농민","농부","농산물","농어촌","농업","농장","농촌","다문화","단체","대안","대학",
             "대회","도서관","도심","도예","독거","독서","동아리","된장","드라마","들꽃","레지던스","먹거리","메밀","명상","명소","목공","목재","목조","무대","문학관","문화","미디어","미술","민속",
             "바다","박물관","반딧불","발명","발전","방문","방제","방학","배양","보건","보존","보호","복지","복합","볼거리","북카페","사람","사랑방","사무실","사업","사이클링","사진","사회복지","산림",
             "산업","상담","생명","생물","생산","생태","생활","샤워실","서비스","세미나","세트","센터","소년","소득","소리","소외","소통","수감","수련","수상","수익","수집","수학여행","숙박","숙소","스쿨",
             "스튜디오","시골","시민","시설","식당","식물","식사","실습","실험","심리","아동","아리랑","아이","아카데미","아트","안전","안정","야구장","야영","야외","양성","어린이","업무","에코","여행",
             "역사","연구","연극","연수","염색","영농","영상","영어","영화","예방","예술","예절","외국어","운동","워크숍","원어민","위치","유관","유형","육성","의상","이용","인근","인력","인성","인원",
             "인재","인터넷","인형","일자리","자연","자전거","작가","작업","작품","장애인","재단","재배","재현","재활","전경","전기","전문","전시","전통","정서","정신","제작","제조","조각","조성","조형",
             "주말","주민","주방","주변","주차","주택","준비","중독","지리","지식","지역","지원","직업","집단","창고","창의","창작","창조","천연","청소년","체육","체험","촬영","추억","축제","치료",
             "치유","치즈","친환경","카누","카페","캠핑","커뮤니티","커피","타운","탁구","탐구","탐방","텃밭","테마","토론","특산","특성","페인""펜션","편의","평생","폐교","프로그램","프로젝트","피해자",
             "학교","학교폭력","학습","항쟁","해양","해충","행사","현장","홍보","환경","활성화","활용","회화","훈련","휴게실","휴식","휴양"]
    terms = list(set(terms))

    #allTerms = get_allNouns("textfromnews.txt")

    tfidfDict = run_tfidf(terms, 'textfromnews.txt')
    to_excel(tfidfDict)
    preprocess_forWordcloud(tfidfDict)

